Repository: rmraya/JavaPM
Catalog: JavaPM_es.tmx
Source language: en
Languages: es

source: Missing '-src' parameter
es: Falta el parámetro '-src'

source: Missing '-xliff' parameter
es: Falta el parámetro '-xliff'

source: Missing '-srcLang' parameter
es: Falta el parámetro '-srcLang'

source: 'src' folder does not exist
es: La carpeta 'src' no existe

source: 'catalog' folder not found
es: No se encontró la carpeta 'catalog'

source: Catalog file does not exist
es: El archivo de catálogo no existe

source: 'srx' folder not found
es: No se encontró la carpeta 'srx'

source: SRX file does not exist
es: El archivo SRX no existe

source: There are no '.properties' files to process
es: No hay archivos '.properties' para procesar

source: Usage: {0} [-help] -src sourceFolder -xliff xliffFile -srcLang sourceLanguage [-enc characterSet] [-tgtLang targetLanguage] [-2.0] Where: -help: (optional) display this help information and exit -src: source code folder -xliff: XLIFF file to generate -srcLang: source language code -enc: (optional) character set code for .properties files; default: ISO-8859-1 -tgtLang: (optional) target language code -2.0: (optional) generate XLIFF 2.0
es: Uso: {0} [-help] -src carpeta -xliff archivoXliff -srcLang idiomaOrigen [-enc characterSet] [-tgtLang idiomaDestino] [-2.0] Dónde: -help: (opcional) mostrar esta información de ayuda y salir -src: carpeta de código fuente -xliff: archivo XLIFF a generar -srcLang: código del idioma origen -enc: (opcional) código de juego de caracteres para archivos .properties; valor predeterminado: ISO-8859-1 -tgtLang: (opcional) código de idioma de destino -2.0: (opcional) generar XLIFF 2.0

source: 'xliff' file does not exist
es: El archivo 'xliff' no existe

source: Selected file is not an XLIFF document
es: El archivo seleccionado no es un documento XLIFF

source: Target language not set
es: Idioma de destino no establecido

source: Error exporting TMX: {0}
es: Error al exportar TMX: {0}

source: File is not a Java .properties bundle
es: El archivo no es un paquete .properties de Java

source: Usage: {0} [-help] -src sourceFolder -xliff xliffFile [-unapproved] [-export] Where: -help: (optional) display this help information and exit -src: source code folder -xliff: XLIFF file to merge -unapproved: (optional) accept translations from unapproved segments -export: (optional) generate TMX file from approved segments
es: Uso: {0} [-help] -src carpeta -xliff archivoXliff [-unapproved] [-export] Dónde: -help: (opcional) mostrar esta información de ayuda y salir -src: carpeta de código fuente -xliff: archivo XLIFF a importar -unapproved: (opcional) aceptar traducciones de segmentos no aprobados -export: (opcional) generar archivo TMX a partir de segmentos aprobados
